#include <stdio.h>
#include <cs50.h>
int main(void)
{
    long long int number;   // номер картки
    int q = 0;              // кількість цифр в номері карти
    int a = 0;              // Сума усіх парних цифр в номері, пмножених на 2, починаючи з кінця
    int c = 0;              // Сума усіх непарних цифр у номері картки, починаючи з кінця
    int sum;                // Контрольна сума цифр в номері
    do
    {
        printf ("Number: ");
        number = get_long_long();
    }
    while (number <= 0);
    long long int n0 = number;
    // Визначення кількості цифр в номері карти
    do
    {
        n0 /= 10;
        if (n0 >= 0)
        {
            q++;
        }
    }
    while (n0 >= 1);
    // Визначення суми усіх парних цифр в номері, пмножених на 2, починаючи з кінця
    long long int n1 = number;  // застосовуємо 1-шу допоміжну змінну, аби працбювати з номером картки
    do
    {
        int b = 0;
        n1 /= 10;
        b = n1 % 10;
        b *= 2;
        if (b >= 10)            // якщо цифра в номері помножена на 2 рінва або більше 10, то сумуємо першу і дргу цифру
        {
            b = 1 + (b % 10);
        }
        a += b;
        n1 /= 10;
    }
    while (n1 > 10);
    // Визначення суми усіх непарних цифр у номері картки, починаючи з кінця
    long long int n2 = number; //застосовуємо 2-гу допоміжну змінну, аби працбювати з номером картки
    do
    {
        int b = 0;
        b = n2 % 10;
        c += b;
        n2 = n2 / 100;
    }
    while (n2 >= 1);
    sum = a + c;   // Контрольна сума цифр в номері
    //знаходження перших двох цифр в номері картки для визначення платіжної системи
    do
    {
        number = number / 10;
    }
    while (number > 100);
    // перевірка на приналежність картки до AMEX, MASTERCARD або VISA
    if ( sum % 10 == 0)
    {
        if (q == 15 && (number == 34 || number == 37))
        {
            printf ("AMEX\n");
        }
        else if (q == 16 && (number >= 51 && number <= 55))
        {
            printf ("MASTERCARD\n");
        }
        else if ((q == 13 || q == 16) && (number >= 40 && number <= 49))
        {
            printf ("VISA\n");
        }
        else
        {
            printf ("INVALID\n");
        }
    }
    else
    {
        printf ("INVALID\n");
    }
    return 0;
}